Revit 2027 API
ParameterTypeId.RebarShapeAllowedBarTypes Property
 "Allowable Rebar Bar Types"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeAllowedBarTypes { get; }
Public Shared ReadOnly Property RebarShapeAllowedBarTypes As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeAllowedBarTypes {
	ForgeTypeId^ get ();
}
static member RebarShapeAllowedBarTypes : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace